import Card from '../card/Card';
import './Food.css';

function Food() {
  return (
    <div className='container'>


        <Card 
          image='./assets/images/foodimages/protine.jpg' 
          title="البروتينات" 
          intro="البروتينات تلعب دورًا محوريًا في الرياضة والأنشطة البدنية نظرًا لدورها في بناء العضلات، إصلاح الأنسجة التالفة، وتعزيز الأداء الرياضي .."
          info="الرياضيون يحتاجون إلى كميات كافية من البروتين لدعم جهودهم التدريبية وتحقيق أهدافهم. تنقسم الأحماض الأمينيّة إلى نوعين، وهي: الأحماض الأمينية غير الأساسيّة التي يُصنّعها الجسم بنفسه، والأحماض الأمينية الأساسيّة التي لا يُمكن للجسم أن يُصنعها، إذ يجب الحصول عليها من المصادر الغذائية..."
        />
        <Card 
          image='./assets/images/foodimages/protine2.jpg' 
          title="دورها في الرياضة" 
          intro="المصادر الحيوانية: ومن الأمثلة على المصادر الحيوانية للبروتين ما يأتي: الدواجن: كالدجاج، والبط، والتيركي..."
          info="الدجاج المطبوخ منزوع الجلد (ما يعادل حجم راحة اليد) على 32.1 غراماً من البروتين. الأطعمة البحرية: كالسمك، والمحار..."
        />
        <Card 
          image='./assets/images/foodimages/protine3.jpg' 
          title="مصادر البروتين" 
          intro="من المهم الحصول على البروتينات من المصادر النباتية أيضاً، وفي ما يأتي بعض الأمثلة على المجموعات النباتية..."
          info="البقوليات: كالعدس، والفاصولياء المجففة بأنواعها، والبازلاء، والحمص..."
        />



        <Card 
          image='./assets/images/foodimages/Carbs1.jpg' 
          title="الكربوهيدرات" 
          intro="هي المصدر المفضل للجسم للحصول على الطاقة..."
          info="من الضروري أن يحتوي نظامك الغذائي على الكربوهيدرات ولكن من الضروري أيضا التركيز في الأوقات..."
        />
        <Card 
          image='./assets/images/foodimages/Carbs2.jpg' 
          title="أهمية الكربوهيدرات" 
          intro="مصدر طاقة رئيسي: يتم تحويل الكربوهيدرات في الجسم إلى جلوكوز..."
          info="الكربوهيدرات تعد أحد العناصر الغذائية الأساسية التي يحتاجها الجسم..."
        />
        <Card 
          image='./assets/images/foodimages/Carbs3.jpg' 
          title="متى نتناول الكربوهيدرات؟" 
          intro="قبل التمارين: تناول وجبة غنية بالكربوهيدرات قبل 2-3 ساعات من التمرين..."
          info="أثناء التمارين الطويلة: في التمارين التي تدوم أكثر من ساعة..."
        />


        <Card 
          image='./assets/images/foodimages/fiber1.jpg' 
          title="الألياف الغذائية" 
          intro="تعد جزءًا مهمًا من النظام الغذائي الصحي، ولها دور هام في تحسين صحة الجهاز الهضمي..."
          info="مكونات موجودة في الأطعمة النباتية التي لا يستطيع الجهاز الهضمي هضمها بالكامل..."
        />
        <Card 
          image='./assets/images/foodimages/fiber2.jpg' 
          title="فوائد الألياف"
          intro="تحسين صحة الجهاز الهضمي: تساعد الألياف على تعزيز حركة الأمعاء..."
          info="الحفاظ على طاقة مستدامة: تناول الألياف مع الكربوهيدرات يساعد على إطلاق الطاقة بشكل بطيء..."
        />
        <Card 
          image='./assets/images/foodimages/fiber3.jpg' 
          title="مصادر غذائية غنية بالألياف" 
          intro="الخضروات: السبانخ البروكلي الجزر"
          info="الفواكه: التوت التفاح الكمثرى الحبوب الكاملة: الشوفان الأرز البني..."
        />
        <Card 
  image='./assets/images/foodimages/images.jpeg' 
  title="الألياف والحفاظ على الوزن" 
  intro="الألياف تلعب دورًا هامًا في الحفاظ على الوزن الصحي من خلال الشعور بالشبع لفترة أطول."
  info="تساعد الألياف في تنظيم مستويات السكر في الدم، مما يقلل من الحاجة إلى تناول الطعام بشكل متكرر. كما أن الأطعمة الغنية بالألياف منخفضة في السعرات الحرارية، مما يجعلها مثالية لمن يسعى لإنقاص الوزن."
      />
    </div>
  );
}

export default Food;
